Revit 2024 API
TableData.IsEqual Method
 Checks if this element is equal in value to the other element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public bool IsEqual(
	TableData OtherElem
)
Visual Basic
Public Function IsEqual ( _
	OtherElem As TableData _
) As Boolean
Visual C++
public:
bool IsEqual(
	TableData^ OtherElem
)
Parameters
OtherElem
Type: Autodesk.Revit.DB.TableData
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
TableData Class
Autodesk.Revit.DB Namespace